//
//  CharactersSet.swift
//  Paragraph
//
//  Created by Александр Коробицын on 18.03.2025.
//

import Foundation

struct CharSets {
    
     static let vowels: [String] = [
         "а", "е", "ё", "и", "о", "у", "ы", "э", "ю", "я",
         "a", "e", "i", "o", "u", "y",
         "à", "â", "æ", "é", "è", "ê", "ë", "í", "ï", "î", "ó", "ô", "œ", "ù", "û", "ü",
         "á", "é", "í", "ó", "ú", "ü", "ñ",
         "ä", "ö", "ü", "é", "è", "á", "í", "ó", "ú",
         "à", "è", "é", "ì", "í", "ò", "ó", "ù",
         "á", "à", "ã", "é", "ê", "í", "ó", "õ", "ô", "ú"
     ]
     
     static let consonants: [String] = [
         "б", "в", "г", "д", "ж", "з", "к", "л", "м", "н", "п", "р", "с", "т", "ф", "х", "ц", "ч", "ш", "щ",
         "b", "c", "d", "f", "g", "h", "j", "k", "l", "m", "n", "p", "q", "r", "s", "t", "v", "w", "x", "y", "z"
     ]
 }
